{
  "id": 4,
  "text": "There's salt and there's salt\nBy: Sheri Wetherell\nPublished: December 11, 2007\n\nI overheard someone say the other day that \"salt is just salt\" and I gasped in horror. I once had uttered something equally as reprehensible to my Italian friend whom, in my opinion, was taking far too long in the pasta aisle. It pains me to admit it but it went something like this, \"Come on, Claudio, pasta is pasta.\" Dio mio! Not the thing to say to an Italian in Italy who is about to teach you the finer points of their cuisine. My young-culinary-inadequate self was quickly schooled. Pasta is not pasta.\nAnd salt is not salt.\nWell, okay, chemists would probably disagree as technically all salt is basically sodium chloride. But, chefs would agree that salts vary widely and a particular salt can add that one missing note to a dish. Most chefs use Kosher salt. It's course in texture, has wonderful flavor, contains no additives, dissolves quickly, and is inexpensive.\nWow your guests this season by baking a whole fish in a Kosher salt crust. The steam, unable to escape the crust, is forced back into the fish resulting in a moist and tender delight. It's fun to crack open at the table as well.\nOne of my favorite salts is Sel Gris (Grey Salt), a moist, gray, large-grain sea salt hand harvested in France, usually Brittany or Normandy. There's a wonderful little French restaurant in Seattle called Le Pichet that serves a divine paté sprinkled with Sel Gris. Oh, bestill my heart. (Literally, this is an artery clogger but what the hell, every now and then is okay. Just drink up on the red to help the cholesterol levels). In addition to paté it works equally well on fish, meat, salads or sprinkled on heirloom tomatoes.\nAnother favorite of mine is Fleur de Sel. This flowery salt is located on top of Sel Gris and is hand harvested only when weather conditions are perfect, thus making it the most expensive sea salt. Well worth it! It's slightly sweet, has a delicate little crunch, and dissolves slowly, so you use less. In Argentina we were served spiced chocolates, one of which was a dark chocolate wafer sprinkled with Fleur de Sel. Such bliss when the flavors of both melted and married in my mouth, enhancing that next sip of Malbec. (These are easy to create at home too. Simply melt some quality chocolate such as Valrhona in a double boiler. Drizzle little dollops onto parchment paper. Let cool slightly then sprinkle a bit of Fleur de Sel or Sel Gris on top. Cool and serve with your favorite red. Sure to delight! Stay tuned for more spiced chocolate ideas...) \nOh! Did I mention that the root of \"salad\" is sal (salt)? Yup. For further reading, check out Mark Kurlansky's Salt: A World History. Great read!!",
  "source": "foodista",
  "added": "2024-05-07T19:57:00.094171",
  "created": "2007-12-11T00:00:00",
  "metadata": {
    "license": "Creative Commons - Attribution - https://creativecommons.org/licenses/by/3.0/",
    "url": "https://foodista.com/blog/2007/12/11/theres-salt-and-theres-salt",
    "authors": [
      "Sheri Wetherell"
    ]
  }
}
