{
  "id": 8,
  "text": "Thoughts from Jim Moore · Global Voices\nRebecca MacKinnon\n\nJim Moore has passed on the following ideas for “the broadest thinkable agenda for global citizen dialogue…”\n“a dialogue that will be net-enabled, plus travel and residency grounded, and that will hopefully generate new forms of individual and collective creativity, and perhaps the formation of new organizations and institutions..\nWhat are the topics that citizens in such a dialogue might address?\nHere are some possible brainstorming starting points..Let me know yours..\nI.  Some topics are going to be “culture-out”–i.e. “how the world looks from our unique vantage point in, say, Iraq, Iran, Ghana or South Africa or the Congo or Sudan–or the US, UK, France, Japan or China or Malaysia–or Mississippi, Texas and Massachusetts.\nFor what it's worth, I was at the Kennedy School Arco Forum the other night for the panel on the genocide in Sudan, and a Chinese student sitting next to me said “the moral tone of this discussion seems pretty strange to us Chinese students, because we see the United States as the most genocidal nation of all..based on clearing the continent of indigenous people–so-called “Indians”–with a national economy built on the near-genocidal enslavement of black Africans..”  This student went on to explain that most of the students he knew in China, including foreign students studying in China, saw the US this way–and learned by painful experience to hide these ideas when in the presence of Americans.\nII.  Others are topics will reflect mega challenges of critical importance to world society–problems that are not being solved by current governments and international organizations.\nE.g. How do we deal with environmental degradation?  I just  heard a stunning talk by Jackman from Scipps on “dead zones” in the oceans.  We are turning vast undersea continents into slime–jellyfish and bacteria–where previously there had been exquisitely complex ecological structure.  Complementing Jackman's talk, E.O. Wilson spoke of the diversity hot zones around the planet–that he claims can be saved for about 29 billion dollars–but that are threatened.  The question for global citizens: What are the “assembly rules” for institutions manifesting global social cognition, global care, and focused action that can proactively and wisely address this crisis?\nE.g. 2:  How do we establish sustainable development and sustainable economics as the central principle of globalization capitalism and business creation?\nE.g. 3:  How do we establish a world that respects human rights and dignity?”\nReactions? Thoughts? Please let us know what you think.",
  "source": "news-globalvoices",
  "added": "2024-05-27T14:45:34.489426",
  "created": "",
  "metadata": {
    "license": "Creative Commons - Attribution - https://creativecommons.org/licenses/by/4.0/",
    "url": "https://globalvoices.org/2004/12/04/thoughts-from-jim-moore/",
    "author": "Rebecca MacKinnon"
  }
}
