{
  "id": 9,
  "text": "About Zimpapers' TV licence... - ZimFact\nNgoni Mhuruyengwe\nMay 16, 2018\nZimbabwe Newspapers Group (Zimpapers), the publicly quoted media company which has interests in newspapers, radio and printing, announced on Wednesday that it had been licenced to provide television broadcasting services.\nFactchecked by ZimFact Staff\nThe group said its Zimpapers Television Network (ZTN) had been handed a content distribution licence by the Broadcasting Authority of Zimbabwe (BAZ).\nThe licencing of Zimpapers, in which the government-created Zimbabwe Mass Media Trust is the biggest shareholder with 51,09 percent, has drawn some criticism from observers who argue that the move seeks to extend the ruling party’s control of public media ahead of the 2018 elections.\nThe Zimpapers group, whose editorial slant is widely considered to be pro-ZANU-PF, owns The Herald, The Sunday Mail, Business Weekly, The Chronicle and Sunday News as well as radio station Star FM. It also has managing contracts for Harare-based metro radio station CapitalkFM and Kariba’s Nyaminyami FM.\nZimbabwe’s opposition is clamouring for media reforms, to allow equitable access to public media, ahead of elections expected by August this year.\nWHICH LICENCE DID ZIMPAPERS GET?\nA lot of the reaction to the licencing of ZTN appears to be based on an erroneous assumption that the Zimpapers unit will now operate the country’s second terrestrial television station, after the Zimbabwe Broadcasting Corporation’s (ZBC) ZTV.\nThis is not the case.\nBAZ has awarded Zimpapers a licence for ‘content distribution’, but not for a ‘commercial broadcasting service’ which would require the use of frequencies.\nIn January this year, BAZ invited entities interested in three ‘broadcast classes’ – video on demand, webcasting and content distribution.\nApart from Zimpapers, Econet Media – which operates Kwese TV – announced early this month that it had been granted three broadcast service licences by BAZ, covering each of the licence classes advertised by BAZ.\nState-owned telecommunications company, TelOne, has also recently been awarded a broadcast licence to offer video on demand services.\nSO, WHAT IS A CONTENT DISTRIBUTION LICENCE?\nBAZ has 12 broadcast service licence classes, namely:\nAccording to BAZ, a content distribution service is defined as “a service provided by a content distributor comprising content aggregated within and outside Zimbabwe that is made available in Zimbabwe with or without payment of a subscription fee and the reception is through satellite.”\nWhat this means is that ZTN, unlike ZBC which runs a free-to-air national television station, will run a subscription service delivered via satellite, with viewers having the choice to either subscribe or not.\nZTN will compete for viewers with services including DStv and Kwese, among others.\nBAZ has not yet advertised for television broadcasting services, which it defines as “any service which delivers television programmes to persons having equipment appropriate for receiving that service, whether the delivery is effected by the means of uses the radio frequency spectrum, cable, optical fibre, satellite or any other means or combination of those means.”\nThis is presumably because the regulator is awaiting completion of the digital broadcasting project, which will create capacity to accommodate more broadcasting services.\nGeorge Charamba, the permanent secretary in the Ministry of Information, Media and Broadcast Services, told radio station ZiFM on April 10, 2018, that government would soon invite applications for 12 national television stations.\nResearched by Cris Chinaka and Nelson Banya\nBAZZANU-PFZBCZIMPAPERS",
  "source": "news-zimfact",
  "added": "2024-05-27T17:38:09.815006",
  "created": "May 16, 2018",
  "metadata": {
    "license": "Creative Commons - Attribution - https://creativecommons.org/licenses/by/4.0/",
    "url": "https://zimfact.org/about-zimpapers-tv-licence/",
    "author": "Ngoni Mhuruyengwe"
  }
}
