{
  "id": 4,
  "text": "A bad wrap? Using packaging well to reduce food waste - 360\nTammara Soma\nPublished on June 15, 2022\nVast amounts of food are sent to landfill. But the jury’s out on whether packaging is friend or foe in the fight against the problem.\nSown, watered, raised, harvested – and dumped. Food wasted in the agricultural powerhouse of Indonesia over the last two decades could have fed up to 125 million people.\nIn recognition of the growing worldwide problem, the agricultural chief scientists from the G20 nations will meet at a food loss and waste prevention workshop in Bali in July 2022. Solving the problem means going beyond agriculture and understanding the role of food packaging. There are many controversies around the environmental impact of packaging, and while no packaging at all is sometimes best, packaging can still play a role in solving the food-waste puzzle.\nFrom 2000 to 2019, as much as 184 kilograms of food per person per year was wasted, accounting for 7.29 percent of Indonesia’s greenhouse-gas emissions. Wasted food costs Indonesia up to 551 trillion rupiah (US$38 billion) each year.\nSome studies show packaging may extend shelf life and reduce loss and waste by protecting food during transportation from farm to retail. In Indonesia, poor-quality packaging has been identified as a driver of food loss. Unhusked rice, for example, spoils and spills when it is not packaged properly.\nBut single-use packaging has been blamed for interfering with household food-waste management: plastic waste contaminates rubbish and hinders composting initiatives. Packaging needs to be removed from wasted food if the food is to be disposed of properly — removing it to extract the food waste at an industrial scale can be expensive and energy intensive. An audit in Australia found 32 percent of plastic food packaging in the rubbish stream contained food.\nOther studies have found 20 to 25 percent of household food waste is directly or indirectly related to packaging issues. Packaging designs can make it difficult to use all the contents, and best-before dates can confuse consumers. If food is past its best-before date, it is often still safe to eat, but consumers may think it must be thrown away. The date just refers to whether the food is at its best in terms of taste or texture.\nPackaging can also be a source of food waste when it prompts food recalls. In the United States, 36,000 cases of thin-sliced cheese were recalled in 2015 because the plastic film covering the cheese was a choking hazard. In 2017 the Canadian Food Inspection Agency recalled yoghurt because there were plastics in the product.\nZero-packaging grocery stores are emerging around the world, especially in Europe and North America. They encourage reusable packaging in sizes that allow consumers to buy only what they need, and they demonstrate the role that more durable reusable packaging could play in  supporting a short food supply chain. This model could be applied in both traditional and modern markets in Indonesia.\nA 2022 study by leading UK sustainability charity WRAP found that selling just five products (apples, bananas, broccoli, cucumber and potatoes) without packaging would save more than 10,300 tonnes of plastic and 100,000 tonnes of food from being wasted annually. Consumers often waste packaged foods because it forces them to buy more than what they need.\nThe role of packaging in food waste reduction and prevention  is an important topic for research and is still up for debate, but what is non-debatable are the negative environmental, social and economic impacts of food waste. Single-use food packaging is a potential source of pollution, particularly because there are infrastructural gaps in waste management in Indonesia, so a systematic approach to understanding the pros and cons of packaging is needed.\nDr Tammara Soma (ORCID 0000-0002-4273-1165) is an Assistant Professor in the School of Resource and Environmental Management at Simon Fraser University, Canada. Her research in Indonesia was funded by the Social Sciences and Humanities Research Council, the Pierre Elliott Trudeau Foundation Doctoral Scholarship, the Dr David Chu Asia Pacific Scholarship and the International Development Research Council. During her fieldwork in Indonesia she was affiliated with the Bogor Agricultural University (Institut Pertanian Bogor).\nThe author has declared no conflict of interest in relation to this article.\nOriginally published under Creative Commons by 360info™.",
  "source": "news-360info",
  "added": "2024-05-27T06:57:36.763796",
  "created": "Published on June 15, 2022",
  "metadata": {
    "license": "Creative Commons - Attribution - https://creativecommons.org/licenses/by/4.0/",
    "url": "https://360info.org/a-bad-wrap-using-packaging-well-to-reduce-food-waste/",
    "author": "Tammara Soma"
  }
}
