{
  "id": 6,
  "text": "A cat in the house saves the birds in the bush - 360\nSarah Legge\nPublished on March 7, 2022\nCats are skillful hunters. In Australia, public campaigning and local government regulation are helping to keep wildlife and domestic cats safer.\nIn suburban Australia, a cat sits in a window, gazing indolently through the glass at fairy-wrens and thornbills popping about in the shrubs. Domesticated in the temples of Egypt around 4,000 years ago, cats were so popular that people transported them around the globe, including Australia. However, these beloved pets also rank as one of the most potent hunters, able to wipe out entire species when arriving in lands whose native inhabitants are unfamiliar with feline hunters.\nWorldwide, domestic cats are responsible for over a quarter of modern mammal, bird and reptile extinctions.\nAustralia is now leading the world in finding ways to reduce their impact.\nWhen cats arrived in Australia with European settlers, they soon left their domestic roles and spread across the continent. Within a human lifetime (around 70 years), they had occupied rainforests, deserts and every habitat in between, eventually covering the entire mainland and larger islands. In that wave, more than 20 mammal species unique to Australia were driven to extinction mainly due to hungry cats. These included creatures such as lesser bilbies, pig-footed bandicoots, rabbit-rats, and hopping mice. Today, the pressure continues unabated: feral cats kill nearly two billion Australian mammals, birds, reptiles and frogs every year; many native species continue to dwindle, and some are close to extinction, thanks partly or wholly to cat predation.\nThe urgency of addressing cat impacts in Australia has forced local scientists to innovate. Mainland fenced exclosures, cat eradications from islands, new poison delivery systems, smart fire and grazing management are just some of the tools keeping native species from extinction.\nIt’s not just feral cats that menace Australian wildlife; that indolent cat in the window is looking at the fairy-wrens and thornbills with murder in its heart. Even though pet cats are fed by their owners, they will still hunt when outside. Pet cats hunt at a lower rate than feral cats, but since they live at high densities, the overall predation toll per square kilometre is actually higher in towns than it is in the bush, and there are documented examples of situations where just one or two cats have wiped out local populations of mammals, birds or reptiles.\nJust as Australia leads the world in the management of feral cats, it is also a global leader in the management of pet cats. Surveys consistently show the Australian public is more aware of cat impacts, and more supportive of managing pet cats, than the public in other countries.\nAlmost a third of Australian pet cats are already kept contained 24/7 indoors or in a secure outdoor area, by their aware owners. Not only is cat containment the simplest and most effective way of stopping cats from killing wildlife, contained cats live much longer than roaming cats, because they aren’t exposed to hurtling cars, mauling dogs, and various diseases.\nThe regulation and management of pet cats, and feral cats that live in towns, falls to local governments. A recent survey asked local governments across Australia what actions they had in place to manage cats, and what they needed to do that job better.\nThe survey showed that local governments view the management of feral and pet cats as interlinked. For example, around half of local governments cap the number of pet cats allowed per household, and require pet cats to be desexed (unless the owner has a breeder licence). Local governments felt these measures were important not just for limiting the numbers of pet cats, but also to prevent pet cats from joining the feral cat population. Most local governments viewed feral cats as a serious problem, and have programs in place to reduce their numbers, usually through trapping. Often, these trapping programs are not regular and intensive enough to make a dint in the feral cat population, but there are exceptions. For example, Brisbane City Council has established an intensive trapping program that is successfully reducing feral cat numbers, after residents complained about the impacts of feral cats on ground-nesting birds including bush stone-curlews, and small mammals such as brown bandicoots.\nMore Australian governments are setting regulations to curb cat presence and movements: almost a third of local governments impose night-time cat curfews, 24/7 cat containment, or even prohibit cats from some suburbs. Some local governments have all three types of regulations. For example, Tweed Shire has cat curfews, cat containment, and cat prohibition zones in different parts of the shire, and has set up monitoring programs in adjacent bushland areas to see if the regulations are successfully reducing the incidence of roaming cats. Tweed Shire Council has coupled these regulations with a “Love Cats, Love Wildlife” program to promote responsible pet cat ownership. In another example, the Australian Capital Territory currently has 17 suburbs where 24/7 cat containment is required, and the government plans to extend compulsory containment over the whole territory in coming years.\nCat containment and prohibition regulations are most common in metropolitan areas, and also on populated islands with high wildlife values, because island communities are increasingly supporting initiatives to reduce the impacts of cats on their wildlife.\nOn Christmas Island, in the Indian Ocean, all pet cats are desexed and ‘new’ cats cannot be imported to the island. Over time, the pet cat population will dwindle to zero, and at the same time feral cats are being eradicated from the island.\nOn Kangaroo Island and Bruny Island, pet cats must be contained 24/7, and programs to reduce feral cat populations are underway. The progression to being cat-free is complete on Rottnest Island, where feral cats were eradicated 20 years ago and pet cats are prohibited. The quokkas that make Rottnest Island famous are thriving, making nature-based tourism a viable living for many island people.\nThe support of the Australian public and local governments for better cat management is unusual. Promoting responsible pet cat management, and reducing feral cat populations, is a more vexed issue in most other countries. But even in Australia there is still a long way to go. Local governments in the survey had a range of suggestions for improvements to legislation, policy and practice that would help contain cats better.\nPet cat management measures vary across local, state and federal governments, resulting in a patchwork of regulations that are confusing and hard to enforce. Whatever the regulations in place, a recurring theme was how important it was for cat owners to take responsibility for their cats.\nCats may be lovely pets, but the Australian public increasingly agrees there’s no place for them in the bush. Reducing the impacts of pet cats is much simpler than controlling feral cats – just keep them contained, as almost a third of cat owners already do. The indolent cat on the window sill will live longer and healthier, and so will the fairy-wrens in the garden.\nSarah Legge is an ecologist and invasive species expert at the Fenner School of Environment and Society, The Australian National University and the Centre for Biodiversity Conservation Science, University of Queensland. This article is based on work Sarah carried out with several colleagues, including Tida Nou, Jaana Dielenberg, Georgia Garrard and John Woinarski.\nThe reserach on cat impacts and cat management by local governments was funded by the Australian Government’s National Environmental Science Program’s through the Threatened Species Recovery Hub.\nThis article has been republished for World Wildlife Day 2023. It was first published on February 28, 2022.\nOriginally published under Creative Commons by 360info™.",
  "source": "news-360info",
  "added": "2024-05-27T06:57:36.763796",
  "created": "Published on March 7, 2022",
  "metadata": {
    "license": "Creative Commons - Attribution - https://creativecommons.org/licenses/by/4.0/",
    "url": "https://360info.org/a-cat-in-the-house-saves-the-birds-in-the-bush/",
    "author": "Sarah Legge"
  }
}
